spanningtree.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>spanningtree</title>
<!-- 2017-01-01 Sun 23:37 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="tnguyen@GiaoChi" />
<link rel="stylesheet" type="text/css" href="../Pub/solarized-light.css" />
</head>
<body>
<div id="content">
<h1 class="title">spanningtree</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Spanning Tree Instances</a></li>
<li><a href="#sec-2">2. Additional Instances</a></li>
</ul>
</div>
</div>
<p>
2#+TITLE:    Degree-Constrained Spanning Tree Benchmark Instances
</p>
