spanningtree.html

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Spanning Tree Instances</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="./instances/spanning_tree/SHRD-Graphs">Directory</a>, 
<a href="./instances/spanning_tree/SHRD-Graphs.tar.gz">tar.gz format</a>
</p>

<p>
<a href="./instances/spanning_tree/SHRD-Graphs/README">README</a>: The CRD and SYM data sets have been obtained from A Volgenant, the remainder have been created by A Ernst and M Krishnamoorthy.
</p>

<table id="tab:spanningtree" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">&#xa0;</th>
<th scope="col" class="left">File</th>
<th scope="col" class="right">Deg</th>
<th scope="col" class="right">Sol<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup></th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd100">crd100  </a></td>
<td class="right">2</td>
<td class="right">7524</td>
</tr>

<tr>
<td class="right">2</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd100">crd100  </a></td>
<td class="right">3</td>
<td class="right"><b>6196</b></td>
</tr>

<tr>
<td class="right">3</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd100">crd100  </a></td>
<td class="right">4</td>
<td class="right"><b>6194</b></td>
</tr>

<tr>
<td class="right">4</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd100">crd100  </a></td>
<td class="right">5</td>
<td class="right"><b>6194</b></td>
</tr>

<tr>
<td class="right">5</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd101">crd101  </a></td>
<td class="right">2</td>
<td class="right">8312</td>
</tr>

<tr>
<td class="right">6</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd101">crd101  </a></td>
<td class="right">3</td>
<td class="right"><b>7004</b></td>
</tr>

<tr>
<td class="right">7</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd101">crd101  </a></td>
<td class="right">4</td>
<td class="right"><b>7004</b></td>
</tr>

<tr>
<td class="right">8</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd101">crd101  </a></td>
<td class="right">5</td>
<td class="right"><b>7004</b></td>
</tr>

<tr>
<td class="right">9</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd102">crd102  </a></td>
<td class="right">2</td>
<td class="right">7995</td>
</tr>

<tr>
<td class="right">10</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd102">crd102  </a></td>
<td class="right">3</td>
<td class="right"><b>6867</b></td>
</tr>

<tr>
<td class="right">11</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd102">crd102  </a></td>
<td class="right">4</td>
<td class="right"><b>6831</b></td>
</tr>

<tr>
<td class="right">12</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd102">crd102  </a></td>
<td class="right">5</td>
<td class="right"><b>6831</b></td>
</tr>

<tr>
<td class="right">13</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd103">crd103  </a></td>
<td class="right">2</td>
<td class="right">8231</td>
</tr>

<tr>
<td class="right">14</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd103">crd103  </a></td>
<td class="right">3</td>
<td class="right"><b>7047</b></td>
</tr>

<tr>
<td class="right">15</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd103">crd103  </a></td>
<td class="right">4</td>
<td class="right"><b>7041</b></td>
</tr>

<tr>
<td class="right">16</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd103">crd103  </a></td>
<td class="right">5</td>
<td class="right"><b>7041</b></td>
</tr>

<tr>
<td class="right">17</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd104">crd104  </a></td>
<td class="right">2</td>
<td class="right">8036</td>
</tr>

<tr>
<td class="right">18</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd104">crd104  </a></td>
<td class="right">3</td>
<td class="right"><b>6946</b></td>
</tr>

<tr>
<td class="right">19</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd104">crd104  </a></td>
<td class="right">4</td>
<td class="right"><b>6946</b></td>
</tr>

<tr>
<td class="right">20</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd104">crd104  </a></td>
<td class="right">5</td>
<td class="right"><b>6946</b></td>
</tr>

<tr>
<td class="right">21</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd105">crd105  </a></td>
<td class="right">2</td>
<td class="right">7660</td>
</tr>

<tr>
<td class="right">22</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd105">crd105  </a></td>
<td class="right">3</td>
<td class="right"><b>6456</b></td>
</tr>

<tr>
<td class="right">23</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd105">crd105  </a></td>
<td class="right">4</td>
<td class="right"><b>6449</b></td>
</tr>

<tr>
<td class="right">24</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd105">crd105  </a></td>
<td class="right">5</td>
<td class="right"><b>6449</b></td>
</tr>

<tr>
<td class="right">25</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd106">crd106  </a></td>
<td class="right">2</td>
<td class="right">7323</td>
</tr>

<tr>
<td class="right">26</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd106">crd106  </a></td>
<td class="right">3</td>
<td class="right"><b>6248</b></td>
</tr>

<tr>
<td class="right">27</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd106">crd106  </a></td>
<td class="right">4</td>
<td class="right"><b>6248</b></td>
</tr>

<tr>
<td class="right">28</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd106">crd106  </a></td>
<td class="right">5</td>
<td class="right"><b>6248</b></td>
</tr>

<tr>
<td class="right">29</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd107">crd107  </a></td>
<td class="right">2</td>
<td class="right">8268</td>
</tr>

<tr>
<td class="right">30</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd107">crd107  </a></td>
<td class="right">3</td>
<td class="right"><b>7125</b></td>
</tr>

<tr>
<td class="right">31</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd107">crd107  </a></td>
<td class="right">4</td>
<td class="right"><b>7125</b></td>
</tr>

<tr>
<td class="right">32</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd107">crd107  </a></td>
<td class="right">5</td>
<td class="right"><b>7125</b></td>
</tr>

<tr>
<td class="right">33</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd108">crd108  </a></td>
<td class="right">2</td>
<td class="right">7424</td>
</tr>

<tr>
<td class="right">34</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd108">crd108  </a></td>
<td class="right">3</td>
<td class="right"><b>6531</b></td>
</tr>

<tr>
<td class="right">35</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd108">crd108  </a></td>
<td class="right">4</td>
<td class="right"><b>6531</b></td>
</tr>

<tr>
<td class="right">36</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd108">crd108  </a></td>
<td class="right">5</td>
<td class="right"><b>6531</b></td>
</tr>

<tr>
<td class="right">37</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd109">crd109  </a></td>
<td class="right">2</td>
<td class="right">7824</td>
</tr>

<tr>
<td class="right">38</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd109">crd109  </a></td>
<td class="right">3</td>
<td class="right"><b>6620</b></td>
</tr>

<tr>
<td class="right">39</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd109">crd109  </a></td>
<td class="right">4</td>
<td class="right"><b>6613</b></td>
</tr>

<tr>
<td class="right">40</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd109">crd109  </a></td>
<td class="right">5</td>
<td class="right"><b>6613</b></td>
</tr>

<tr>
<td class="right">41</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd300">crd300  </a></td>
<td class="right">2</td>
<td class="right"><b>4472</b></td>
</tr>

<tr>
<td class="right">42</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd300">crd300  </a></td>
<td class="right">3</td>
<td class="right"><b>3634</b></td>
</tr>

<tr>
<td class="right">43</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd300">crd300  </a></td>
<td class="right">4</td>
<td class="right"><b>3634</b></td>
</tr>

<tr>
<td class="right">44</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd300">crd300  </a></td>
<td class="right">5</td>
<td class="right"><b>3634</b></td>
</tr>

<tr>
<td class="right">45</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd301">crd301  </a></td>
<td class="right">2</td>
<td class="right"><b>3618</b></td>
</tr>

<tr>
<td class="right">46</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd301">crd301  </a></td>
<td class="right">3</td>
<td class="right"><b>3277</b></td>
</tr>

<tr>
<td class="right">47</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd301">crd301  </a></td>
<td class="right">4</td>
<td class="right"><b>3277</b></td>
</tr>

<tr>
<td class="right">48</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd301">crd301  </a></td>
<td class="right">5</td>
<td class="right"><b>3277</b></td>
</tr>

<tr>
<td class="right">49</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd302">crd302  </a></td>
<td class="right">2</td>
<td class="right"><b>4221</b></td>
</tr>

<tr>
<td class="right">50</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd302">crd302  </a></td>
<td class="right">3</td>
<td class="right"><b>4001</b></td>
</tr>

<tr>
<td class="right">51</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd302">crd302  </a></td>
<td class="right">4</td>
<td class="right"><b>4001</b></td>
</tr>

<tr>
<td class="right">52</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd302">crd302  </a></td>
<td class="right">5</td>
<td class="right"><b>4001</b></td>
</tr>

<tr>
<td class="right">53</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd303">crd303  </a></td>
<td class="right">2</td>
<td class="right"><b>4234</b></td>
</tr>

<tr>
<td class="right">54</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd303">crd303  </a></td>
<td class="right">3</td>
<td class="right"><b>3861</b></td>
</tr>

<tr>
<td class="right">55</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd303">crd303  </a></td>
<td class="right">4</td>
<td class="right"><b>3861</b></td>
</tr>

<tr>
<td class="right">56</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd303">crd303  </a></td>
<td class="right">5</td>
<td class="right"><b>3861</b></td>
</tr>

<tr>
<td class="right">57</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd304">crd304  </a></td>
<td class="right">2</td>
<td class="right"><b>4730</b></td>
</tr>

<tr>
<td class="right">58</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd304">crd304  </a></td>
<td class="right">3</td>
<td class="right"><b>3931</b></td>
</tr>

<tr>
<td class="right">59</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd304">crd304  </a></td>
<td class="right">4</td>
<td class="right"><b>3931</b></td>
</tr>

<tr>
<td class="right">60</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd304">crd304  </a></td>
<td class="right">5</td>
<td class="right"><b>3931</b></td>
</tr>

<tr>
<td class="right">61</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd305">crd305  </a></td>
<td class="right">2</td>
<td class="right"><b>4249</b></td>
</tr>

<tr>
<td class="right">62</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd305">crd305  </a></td>
<td class="right">3</td>
<td class="right"><b>3812</b></td>
</tr>

<tr>
<td class="right">63</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd305">crd305  </a></td>
<td class="right">4</td>
<td class="right"><b>3774</b></td>
</tr>

<tr>
<td class="right">64</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd305">crd305  </a></td>
<td class="right">5</td>
<td class="right"><b>3774</b></td>
</tr>

<tr>
<td class="right">65</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd306">crd306  </a></td>
<td class="right">2</td>
<td class="right"><b>4212</b></td>
</tr>

<tr>
<td class="right">66</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd306">crd306  </a></td>
<td class="right">3</td>
<td class="right"><b>3831</b></td>
</tr>

<tr>
<td class="right">67</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd306">crd306  </a></td>
<td class="right">4</td>
<td class="right"><b>3801</b></td>
</tr>

<tr>
<td class="right">68</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd306">crd306  </a></td>
<td class="right">5</td>
<td class="right"><b>3801</b></td>
</tr>

<tr>
<td class="right">69</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd307">crd307  </a></td>
<td class="right">2</td>
<td class="right"><b>4259</b></td>
</tr>

<tr>
<td class="right">70</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd307">crd307  </a></td>
<td class="right">3</td>
<td class="right"><b>3927</b></td>
</tr>

<tr>
<td class="right">71</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd307">crd307  </a></td>
<td class="right">4</td>
<td class="right"><b>3927</b></td>
</tr>

<tr>
<td class="right">72</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd307">crd307  </a></td>
<td class="right">5</td>
<td class="right"><b>3927</b></td>
</tr>

<tr>
<td class="right">73</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd308">crd308  </a></td>
<td class="right">2</td>
<td class="right"><b>4030</b></td>
</tr>

<tr>
<td class="right">74</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd308">crd308  </a></td>
<td class="right">3</td>
<td class="right"><b>3714</b></td>
</tr>

<tr>
<td class="right">75</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd308">crd308  </a></td>
<td class="right">4</td>
<td class="right"><b>3714</b></td>
</tr>

<tr>
<td class="right">76</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd308">crd308  </a></td>
<td class="right">5</td>
<td class="right"><b>3714</b></td>
</tr>

<tr>
<td class="right">77</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd309">crd309  </a></td>
<td class="right">2</td>
<td class="right"><b>4030</b></td>
</tr>

<tr>
<td class="right">78</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd309">crd309  </a></td>
<td class="right">3</td>
<td class="right"><b>3730</b></td>
</tr>

<tr>
<td class="right">79</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd309">crd309  </a></td>
<td class="right">4</td>
<td class="right"><b>3730</b></td>
</tr>

<tr>
<td class="right">80</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd309">crd309  </a></td>
<td class="right">5</td>
<td class="right"><b>3730</b></td>
</tr>

<tr>
<td class="right">81</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd500">crd500  </a></td>
<td class="right">2</td>
<td class="right"><b>5312</b></td>
</tr>

<tr>
<td class="right">82</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd500">crd500  </a></td>
<td class="right">3</td>
<td class="right"><b>4931</b></td>
</tr>

<tr>
<td class="right">83</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd500">crd500  </a></td>
<td class="right">4</td>
<td class="right"><b>4931</b></td>
</tr>

<tr>
<td class="right">84</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd500">crd500  </a></td>
<td class="right">5</td>
<td class="right"><b>4931</b></td>
</tr>

<tr>
<td class="right">85</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd501">crd501  </a></td>
<td class="right">2</td>
<td class="right">5625</td>
</tr>

<tr>
<td class="right">86</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd501">crd501  </a></td>
<td class="right">3</td>
<td class="right"><b>5126</b></td>
</tr>

<tr>
<td class="right">87</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd501">crd501  </a></td>
<td class="right">4</td>
<td class="right"><b>5126</b></td>
</tr>

<tr>
<td class="right">88</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd501">crd501  </a></td>
<td class="right">5</td>
<td class="right"><b>5126</b></td>
</tr>

<tr>
<td class="right">89</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd502">crd502  </a></td>
<td class="right">2</td>
<td class="right">5507</td>
</tr>

<tr>
<td class="right">90</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd502">crd502  </a></td>
<td class="right">3</td>
<td class="right"><b>4898</b></td>
</tr>

<tr>
<td class="right">91</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd502">crd502  </a></td>
<td class="right">4</td>
<td class="right"><b>4898</b></td>
</tr>

<tr>
<td class="right">92</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd502">crd502  </a></td>
<td class="right">5</td>
<td class="right"><b>4898</b></td>
</tr>

<tr>
<td class="right">93</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd503">crd503  </a></td>
<td class="right">2</td>
<td class="right">5090</td>
</tr>

<tr>
<td class="right">94</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd503">crd503  </a></td>
<td class="right">3</td>
<td class="right"><b>4543</b></td>
</tr>

<tr>
<td class="right">95</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd503">crd503  </a></td>
<td class="right">4</td>
<td class="right"><b>4543</b></td>
</tr>

<tr>
<td class="right">96</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd503">crd503  </a></td>
<td class="right">5</td>
<td class="right"><b>4543</b></td>
</tr>

<tr>
<td class="right">97</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd504">crd504  </a></td>
<td class="right">2</td>
<td class="right">5562</td>
</tr>

<tr>
<td class="right">98</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd504">crd504  </a></td>
<td class="right">3</td>
<td class="right"><b>4733</b></td>
</tr>

<tr>
<td class="right">99</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd504">crd504  </a></td>
<td class="right">4</td>
<td class="right"><b>4733</b></td>
</tr>

<tr>
<td class="right">100</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd504">crd504  </a></td>
<td class="right">5</td>
<td class="right"><b>4733</b></td>
</tr>

<tr>
<td class="right">101</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd505">crd505  </a></td>
<td class="right">2</td>
<td class="right">5579</td>
</tr>

<tr>
<td class="right">102</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd505">crd505  </a></td>
<td class="right">3</td>
<td class="right"><b>4895</b></td>
</tr>

<tr>
<td class="right">103</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd505">crd505  </a></td>
<td class="right">4</td>
<td class="right"><b>4892</b></td>
</tr>

<tr>
<td class="right">104</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd505">crd505  </a></td>
<td class="right">5</td>
<td class="right"><b>4892</b></td>
</tr>

<tr>
<td class="right">105</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd506">crd506  </a></td>
<td class="right">2</td>
<td class="right">5180</td>
</tr>

<tr>
<td class="right">106</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd506">crd506  </a></td>
<td class="right">3</td>
<td class="right"><b>4722</b></td>
</tr>

<tr>
<td class="right">107</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd506">crd506  </a></td>
<td class="right">4</td>
<td class="right"><b>4691</b></td>
</tr>

<tr>
<td class="right">108</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd506">crd506  </a></td>
<td class="right">5</td>
<td class="right"><b>4691</b></td>
</tr>

<tr>
<td class="right">109</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd507">crd507  </a></td>
<td class="right">2</td>
<td class="right">5233</td>
</tr>

<tr>
<td class="right">110</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd507">crd507  </a></td>
<td class="right">3</td>
<td class="right"><b>4761</b></td>
</tr>

<tr>
<td class="right">111</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd507">crd507  </a></td>
<td class="right">4</td>
<td class="right"><b>4761</b></td>
</tr>

<tr>
<td class="right">112</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd507">crd507  </a></td>
<td class="right">5</td>
<td class="right"><b>4761</b></td>
</tr>

<tr>
<td class="right">113</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd508">crd508  </a></td>
<td class="right">2</td>
<td class="right"><b>5371</b></td>
</tr>

<tr>
<td class="right">114</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd508">crd508  </a></td>
<td class="right">3</td>
<td class="right"><b>5008</b></td>
</tr>

<tr>
<td class="right">115</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd508">crd508  </a></td>
<td class="right">4</td>
<td class="right"><b>5008</b></td>
</tr>

<tr>
<td class="right">116</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd508">crd508  </a></td>
<td class="right">5</td>
<td class="right"><b>5008</b></td>
</tr>

<tr>
<td class="right">117</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd509">crd509  </a></td>
<td class="right">2</td>
<td class="right">5345</td>
</tr>

<tr>
<td class="right">118</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd509">crd509  </a></td>
<td class="right">3</td>
<td class="right"><b>4607</b></td>
</tr>

<tr>
<td class="right">119</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd509">crd509  </a></td>
<td class="right">4</td>
<td class="right"><b>4607</b></td>
</tr>

<tr>
<td class="right">120</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd509">crd509  </a></td>
<td class="right">5</td>
<td class="right"><b>4607</b></td>
</tr>

<tr>
<td class="right">121</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd700">crd700  </a></td>
<td class="right">2</td>
<td class="right">6544</td>
</tr>

<tr>
<td class="right">122</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd700">crd700  </a></td>
<td class="right">3</td>
<td class="right"><b>5789</b></td>
</tr>

<tr>
<td class="right">123</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd700">crd700  </a></td>
<td class="right">4</td>
<td class="right"><b>5789</b></td>
</tr>

<tr>
<td class="right">124</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd700">crd700  </a></td>
<td class="right">5</td>
<td class="right"><b>5789</b></td>
</tr>

<tr>
<td class="right">125</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd701">crd701  </a></td>
<td class="right">2</td>
<td class="right">6182</td>
</tr>

<tr>
<td class="right">126</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd701">crd701  </a></td>
<td class="right">3</td>
<td class="right"><b>5849</b></td>
</tr>

<tr>
<td class="right">127</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd701">crd701  </a></td>
<td class="right">4</td>
<td class="right"><b>5848</b></td>
</tr>

<tr>
<td class="right">128</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd701">crd701  </a></td>
<td class="right">5</td>
<td class="right"><b>5848</b></td>
</tr>

<tr>
<td class="right">129</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd702">crd702  </a></td>
<td class="right">2</td>
<td class="right">7089</td>
</tr>

<tr>
<td class="right">130</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd702">crd702  </a></td>
<td class="right">3</td>
<td class="right"><b>6167</b></td>
</tr>

<tr>
<td class="right">131</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd702">crd702  </a></td>
<td class="right">4</td>
<td class="right"><b>6167</b></td>
</tr>

<tr>
<td class="right">132</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd702">crd702  </a></td>
<td class="right">5</td>
<td class="right"><b>6167</b></td>
</tr>

<tr>
<td class="right">133</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd703">crd703  </a></td>
<td class="right">2</td>
<td class="right">6606</td>
</tr>

<tr>
<td class="right">134</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd703">crd703  </a></td>
<td class="right">3</td>
<td class="right"><b>5894</b></td>
</tr>

<tr>
<td class="right">135</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd703">crd703  </a></td>
<td class="right">4</td>
<td class="right"><b>5878</b></td>
</tr>

<tr>
<td class="right">136</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd703">crd703  </a></td>
<td class="right">5</td>
<td class="right"><b>5878</b></td>
</tr>

<tr>
<td class="right">137</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd704">crd704  </a></td>
<td class="right">2</td>
<td class="right">6642</td>
</tr>

<tr>
<td class="right">138</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd704">crd704  </a></td>
<td class="right">3</td>
<td class="right"><b>5590</b></td>
</tr>

<tr>
<td class="right">139</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd704">crd704  </a></td>
<td class="right">4</td>
<td class="right"><b>5590</b></td>
</tr>

<tr>
<td class="right">140</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd704">crd704  </a></td>
<td class="right">5</td>
<td class="right"><b>5590</b></td>
</tr>

<tr>
<td class="right">141</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd705">crd705  </a></td>
<td class="right">2</td>
<td class="right">6779</td>
</tr>

<tr>
<td class="right">142</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd705">crd705  </a></td>
<td class="right">3</td>
<td class="right"><b>5854</b></td>
</tr>

<tr>
<td class="right">143</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd705">crd705  </a></td>
<td class="right">4</td>
<td class="right"><b>5853</b></td>
</tr>

<tr>
<td class="right">144</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd705">crd705  </a></td>
<td class="right">5</td>
<td class="right"><b>5853</b></td>
</tr>

<tr>
<td class="right">145</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd706">crd706  </a></td>
<td class="right">2</td>
<td class="right">6859</td>
</tr>

<tr>
<td class="right">146</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd706">crd706  </a></td>
<td class="right">3</td>
<td class="right"><b>6078</b></td>
</tr>

<tr>
<td class="right">147</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd706">crd706  </a></td>
<td class="right">4</td>
<td class="right"><b>6078</b></td>
</tr>

<tr>
<td class="right">148</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd706">crd706  </a></td>
<td class="right">5</td>
<td class="right"><b>6078</b></td>
</tr>

<tr>
<td class="right">149</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd707">crd707  </a></td>
<td class="right">2</td>
<td class="right">6668</td>
</tr>

<tr>
<td class="right">150</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd707">crd707  </a></td>
<td class="right">3</td>
<td class="right"><b>5985</b></td>
</tr>

<tr>
<td class="right">151</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd707">crd707  </a></td>
<td class="right">4</td>
<td class="right"><b>5985</b></td>
</tr>

<tr>
<td class="right">152</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd707">crd707  </a></td>
<td class="right">5</td>
<td class="right"><b>5985</b></td>
</tr>

<tr>
<td class="right">153</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd708">crd708  </a></td>
<td class="right">2</td>
<td class="right">6419</td>
</tr>

<tr>
<td class="right">154</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd708">crd708  </a></td>
<td class="right">3</td>
<td class="right"><b>5803</b></td>
</tr>

<tr>
<td class="right">155</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd708">crd708  </a></td>
<td class="right">4</td>
<td class="right"><b>5803</b></td>
</tr>

<tr>
<td class="right">156</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd708">crd708  </a></td>
<td class="right">5</td>
<td class="right"><b>5803</b></td>
</tr>

<tr>
<td class="right">157</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd709">crd709  </a></td>
<td class="right">2</td>
<td class="right">6427</td>
</tr>

<tr>
<td class="right">158</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd709">crd709  </a></td>
<td class="right">3</td>
<td class="right"><b>5502</b></td>
</tr>

<tr>
<td class="right">159</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd709">crd709  </a></td>
<td class="right">4</td>
<td class="right"><b>5502</b></td>
</tr>

<tr>
<td class="right">160</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/crd709">crd709  </a></td>
<td class="right">5</td>
<td class="right"><b>5502</b></td>
</tr>

<tr>
<td class="right">161</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd150">shrd150</a></td>
<td class="right">2</td>
<td class="right">895</td>
</tr>

<tr>
<td class="right">162</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd150">shrd150</a></td>
<td class="right">3</td>
<td class="right"><b>582</b></td>
</tr>

<tr>
<td class="right">163</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd150">shrd150</a></td>
<td class="right">4</td>
<td class="right">430</td>
</tr>

<tr>
<td class="right">164</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd150">shrd150</a></td>
<td class="right">5</td>
<td class="right">339</td>
</tr>

<tr>
<td class="right">165</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd159">shrd159</a></td>
<td class="right">2</td>
<td class="right">906</td>
</tr>

<tr>
<td class="right">166</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd159">shrd159</a></td>
<td class="right">3</td>
<td class="right">597</td>
</tr>

<tr>
<td class="right">167</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd159">shrd159</a></td>
<td class="right">4</td>
<td class="right">430</td>
</tr>

<tr>
<td class="right">168</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd159">shrd159</a></td>
<td class="right">5</td>
<td class="right">332</td>
</tr>

<tr>
<td class="right">169</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd200">shrd200</a></td>
<td class="right">2</td>
<td class="right">1873</td>
</tr>

<tr>
<td class="right">170</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd200">shrd200</a></td>
<td class="right">3</td>
<td class="right">1100</td>
</tr>

<tr>
<td class="right">171</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd200">shrd200</a></td>
<td class="right">4</td>
<td class="right">829</td>
</tr>

<tr>
<td class="right">172</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd200">shrd200</a></td>
<td class="right">5</td>
<td class="right">638</td>
</tr>

<tr>
<td class="right">173</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd209">shrd209</a></td>
<td class="right">2</td>
<td class="right">1808</td>
</tr>

<tr>
<td class="right">174</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd209">shrd209</a></td>
<td class="right">3</td>
<td class="right">1106</td>
</tr>

<tr>
<td class="right">175</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd209">shrd209</a></td>
<td class="right">4</td>
<td class="right">807</td>
</tr>

<tr>
<td class="right">176</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd209">shrd209</a></td>
<td class="right">5</td>
<td class="right">634</td>
</tr>

<tr>
<td class="right">177</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd258">shrd258</a></td>
<td class="right">2</td>
<td class="right">2953</td>
</tr>

<tr>
<td class="right">178</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd258">shrd258</a></td>
<td class="right">3</td>
<td class="right">1838</td>
</tr>

<tr>
<td class="right">179</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd258">shrd258</a></td>
<td class="right">4</td>
<td class="right">1302</td>
</tr>

<tr>
<td class="right">180</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd258">shrd258</a></td>
<td class="right">5</td>
<td class="right">1007</td>
</tr>

<tr>
<td class="right">181</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd259">shrd259</a></td>
<td class="right">2</td>
<td class="right">2984</td>
</tr>

<tr>
<td class="right">182</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd259">shrd259</a></td>
<td class="right">3</td>
<td class="right">1870</td>
</tr>

<tr>
<td class="right">183</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd259">shrd259</a></td>
<td class="right">4</td>
<td class="right">1312</td>
</tr>

<tr>
<td class="right">184</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd259">shrd259</a></td>
<td class="right">5</td>
<td class="right">1019</td>
</tr>

<tr>
<td class="right">185</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd300">shrd300</a></td>
<td class="right">2</td>
<td class="right">4560</td>
</tr>

<tr>
<td class="right">186</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd300">shrd300</a></td>
<td class="right">3</td>
<td class="right">2738</td>
</tr>

<tr>
<td class="right">187</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd300">shrd300</a></td>
<td class="right">4</td>
<td class="right">1965</td>
</tr>

<tr>
<td class="right">188</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd300">shrd300</a></td>
<td class="right">5</td>
<td class="right">1526</td>
</tr>

<tr>
<td class="right">189</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd309">shrd309</a></td>
<td class="right">2</td>
<td class="right">4268</td>
</tr>

<tr>
<td class="right">190</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd309">shrd309</a></td>
<td class="right">3</td>
<td class="right">2765</td>
</tr>

<tr>
<td class="right">191</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd309">shrd309</a></td>
<td class="right">4</td>
<td class="right">1947</td>
</tr>

<tr>
<td class="right">192</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/shrd309">shrd309</a></td>
<td class="right">5</td>
<td class="right">1487</td>
</tr>

<tr>
<td class="right">193</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1000">str1000</a></td>
<td class="right">2</td>
<td class="right">5211</td>
</tr>

<tr>
<td class="right">194</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1000">str1000</a></td>
<td class="right">3</td>
<td class="right"><b>4702</b></td>
</tr>

<tr>
<td class="right">195</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1000">str1000</a></td>
<td class="right">4</td>
<td class="right"><b>4546</b></td>
</tr>

<tr>
<td class="right">196</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1000">str1000</a></td>
<td class="right">5</td>
<td class="right"><b>4403</b></td>
</tr>

<tr>
<td class="right">197</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1001">str1001</a></td>
<td class="right">2</td>
<td class="right">5211</td>
</tr>

<tr>
<td class="right">198</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1001">str1001</a></td>
<td class="right">3</td>
<td class="right"><b>4702</b></td>
</tr>

<tr>
<td class="right">199</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1001">str1001</a></td>
<td class="right">4</td>
<td class="right"><b>4546</b></td>
</tr>

<tr>
<td class="right">200</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1001">str1001</a></td>
<td class="right">5</td>
<td class="right"><b>4403</b></td>
</tr>

<tr>
<td class="right">201</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1002">str1002</a></td>
<td class="right">2</td>
<td class="right">7276</td>
</tr>

<tr>
<td class="right">202</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1002">str1002</a></td>
<td class="right">3</td>
<td class="right"><b>6713</b></td>
</tr>

<tr>
<td class="right">203</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1002">str1002</a></td>
<td class="right">4</td>
<td class="right"><b>6511</b></td>
</tr>

<tr>
<td class="right">204</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1002">str1002</a></td>
<td class="right">5</td>
<td class="right"><b>6362</b></td>
</tr>

<tr>
<td class="right">205</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1003">str1003</a></td>
<td class="right">2</td>
<td class="right">7276</td>
</tr>

<tr>
<td class="right">206</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1003">str1003</a></td>
<td class="right">3</td>
<td class="right"><b>6713</b></td>
</tr>

<tr>
<td class="right">207</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1003">str1003</a></td>
<td class="right">4</td>
<td class="right"><b>6511</b></td>
</tr>

<tr>
<td class="right">208</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1003">str1003</a></td>
<td class="right">5</td>
<td class="right"><b>6362</b></td>
</tr>

<tr>
<td class="right">209</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1004">str1004</a></td>
<td class="right">2</td>
<td class="right">8935</td>
</tr>

<tr>
<td class="right">210</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1004">str1004</a></td>
<td class="right">3</td>
<td class="right"><b>8313</b></td>
</tr>

<tr>
<td class="right">211</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1004">str1004</a></td>
<td class="right">4</td>
<td class="right"><b>8117</b></td>
</tr>

<tr>
<td class="right">212</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1004">str1004</a></td>
<td class="right">5</td>
<td class="right"><b>7930</b></td>
</tr>

<tr>
<td class="right">213</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1005">str1005</a></td>
<td class="right">2</td>
<td class="right">8935</td>
</tr>

<tr>
<td class="right">214</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1005">str1005</a></td>
<td class="right">3</td>
<td class="right"><b>8313</b></td>
</tr>

<tr>
<td class="right">215</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1005">str1005</a></td>
<td class="right">4</td>
<td class="right"><b>8117</b></td>
</tr>

<tr>
<td class="right">216</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1005">str1005</a></td>
<td class="right">5</td>
<td class="right"><b>7930</b></td>
</tr>

<tr>
<td class="right">217</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1006">str1006</a></td>
<td class="right">2</td>
<td class="right">10684</td>
</tr>

<tr>
<td class="right">218</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1006">str1006</a></td>
<td class="right">3</td>
<td class="right">1* 0155*</td>
</tr>

<tr>
<td class="right">219</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1006">str1006</a></td>
<td class="right">4</td>
<td class="right"><b>9951</b></td>
</tr>

<tr>
<td class="right">220</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1006">str1006</a></td>
<td class="right">5</td>
<td class="right"><b>9756</b></td>
</tr>

<tr>
<td class="right">221</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1007">str1007</a></td>
<td class="right">2</td>
<td class="right">10684</td>
</tr>

<tr>
<td class="right">222</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1007">str1007</a></td>
<td class="right">3</td>
<td class="right">1* 0155*</td>
</tr>

<tr>
<td class="right">223</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1007">str1007</a></td>
<td class="right">4</td>
<td class="right"><b>9951</b></td>
</tr>

<tr>
<td class="right">224</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1007">str1007</a></td>
<td class="right">5</td>
<td class="right"><b>9756</b></td>
</tr>

<tr>
<td class="right">225</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1008">str1008</a></td>
<td class="right">2</td>
<td class="right">12625</td>
</tr>

<tr>
<td class="right">226</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1008">str1008</a></td>
<td class="right">3</td>
<td class="right">1* 1952*</td>
</tr>

<tr>
<td class="right">227</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1008">str1008</a></td>
<td class="right">4</td>
<td class="right">11726</td>
</tr>

<tr>
<td class="right">228</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1008">str1008</a></td>
<td class="right">5</td>
<td class="right">11530</td>
</tr>

<tr>
<td class="right">229</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1009">str1009</a></td>
<td class="right">2</td>
<td class="right">12568</td>
</tr>

<tr>
<td class="right">230</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1009">str1009</a></td>
<td class="right">3</td>
<td class="right">1* 1985*</td>
</tr>

<tr>
<td class="right">231</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1009">str1009</a></td>
<td class="right">4</td>
<td class="right">11767</td>
</tr>

<tr>
<td class="right">232</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str1009">str1009</a></td>
<td class="right">5</td>
<td class="right">11571</td>
</tr>

<tr>
<td class="right">233</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str300">str300  </a></td>
<td class="right">2</td>
<td class="right"><b>4173</b></td>
</tr>

<tr>
<td class="right">234</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str300">str300  </a></td>
<td class="right">3</td>
<td class="right"><b>3924</b></td>
</tr>

<tr>
<td class="right">235</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str300">str300  </a></td>
<td class="right">4</td>
<td class="right"><b>3761</b></td>
</tr>

<tr>
<td class="right">236</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str300">str300  </a></td>
<td class="right">5</td>
<td class="right"><b>3605</b></td>
</tr>

<tr>
<td class="right">237</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str301">str301  </a></td>
<td class="right">2</td>
<td class="right"><b>4171</b></td>
</tr>

<tr>
<td class="right">238</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str301">str301  </a></td>
<td class="right">3</td>
<td class="right"><b>3907</b></td>
</tr>

<tr>
<td class="right">239</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str301">str301  </a></td>
<td class="right">4</td>
<td class="right"><b>3753</b></td>
</tr>

<tr>
<td class="right">240</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str301">str301  </a></td>
<td class="right">5</td>
<td class="right"><b>3600</b></td>
</tr>

<tr>
<td class="right">241</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str302">str302  </a></td>
<td class="right">2</td>
<td class="right"><b>5706</b></td>
</tr>

<tr>
<td class="right">242</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str302">str302  </a></td>
<td class="right">3</td>
<td class="right"><b>5434</b></td>
</tr>

<tr>
<td class="right">243</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str302">str302  </a></td>
<td class="right">4</td>
<td class="right"><b>5237</b></td>
</tr>

<tr>
<td class="right">244</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str302">str302  </a></td>
<td class="right">5</td>
<td class="right"><b>5089</b></td>
</tr>

<tr>
<td class="right">245</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str303">str303  </a></td>
<td class="right">2</td>
<td class="right"><b>5660</b></td>
</tr>

<tr>
<td class="right">246</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str303">str303  </a></td>
<td class="right">3</td>
<td class="right"><b>5352</b></td>
</tr>

<tr>
<td class="right">247</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str303">str303  </a></td>
<td class="right">4</td>
<td class="right"><b>5152</b></td>
</tr>

<tr>
<td class="right">248</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str303">str303  </a></td>
<td class="right">5</td>
<td class="right"><b>4990</b></td>
</tr>

<tr>
<td class="right">249</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str304">str304  </a></td>
<td class="right">2</td>
<td class="right"><b>7089</b></td>
</tr>

<tr>
<td class="right">250</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str304">str304  </a></td>
<td class="right">3</td>
<td class="right"><b>6763</b></td>
</tr>

<tr>
<td class="right">251</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str304">str304  </a></td>
<td class="right">4</td>
<td class="right"><b>6559</b></td>
</tr>

<tr>
<td class="right">252</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str304">str304  </a></td>
<td class="right">5</td>
<td class="right"><b>6368</b></td>
</tr>

<tr>
<td class="right">253</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str305">str305  </a></td>
<td class="right">2</td>
<td class="right"><b>7187</b></td>
</tr>

<tr>
<td class="right">254</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str305">str305  </a></td>
<td class="right">3</td>
<td class="right"><b>6874</b></td>
</tr>

<tr>
<td class="right">255</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str305">str305  </a></td>
<td class="right">4</td>
<td class="right"><b>6665</b></td>
</tr>

<tr>
<td class="right">256</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str305">str305  </a></td>
<td class="right">5</td>
<td class="right"><b>6467</b></td>
</tr>

<tr>
<td class="right">257</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str306">str306  </a></td>
<td class="right">2</td>
<td class="right">8674</td>
</tr>

<tr>
<td class="right">258</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str306">str306  </a></td>
<td class="right">3</td>
<td class="right"><b>8298</b></td>
</tr>

<tr>
<td class="right">259</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str306">str306  </a></td>
<td class="right">4</td>
<td class="right"><b>8066</b></td>
</tr>

<tr>
<td class="right">260</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str306">str306  </a></td>
<td class="right">5</td>
<td class="right"><b>7871</b></td>
</tr>

<tr>
<td class="right">261</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str307">str307  </a></td>
<td class="right">2</td>
<td class="right"><b>8499</b></td>
</tr>

<tr>
<td class="right">262</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str307">str307  </a></td>
<td class="right">3</td>
<td class="right"><b>8164</b></td>
</tr>

<tr>
<td class="right">263</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str307">str307  </a></td>
<td class="right">4</td>
<td class="right"><b>7964</b></td>
</tr>

<tr>
<td class="right">264</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str307">str307  </a></td>
<td class="right">5</td>
<td class="right"><b>7768</b></td>
</tr>

<tr>
<td class="right">265</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str308">str308  </a></td>
<td class="right">2</td>
<td class="right"><b>9793</b></td>
</tr>

<tr>
<td class="right">266</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str308">str308  </a></td>
<td class="right">3</td>
<td class="right"><b>9432</b></td>
</tr>

<tr>
<td class="right">267</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str308">str308  </a></td>
<td class="right">4</td>
<td class="right"><b>9223</b></td>
</tr>

<tr>
<td class="right">268</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str308">str308  </a></td>
<td class="right">5</td>
<td class="right"><b>9030</b></td>
</tr>

<tr>
<td class="right">269</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str309">str309  </a></td>
<td class="right">2</td>
<td class="right"><b>9948</b></td>
</tr>

<tr>
<td class="right">270</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str309">str309  </a></td>
<td class="right">3</td>
<td class="right"><b>9597</b></td>
</tr>

<tr>
<td class="right">271</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str309">str309  </a></td>
<td class="right">4</td>
<td class="right"><b>9367</b></td>
</tr>

<tr>
<td class="right">272</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str309">str309  </a></td>
<td class="right">5</td>
<td class="right"><b>9169</b></td>
</tr>

<tr>
<td class="right">273</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str500">str500  </a></td>
<td class="right">2</td>
<td class="right">4471</td>
</tr>

<tr>
<td class="right">274</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str500">str500  </a></td>
<td class="right">3</td>
<td class="right"><b>4128</b></td>
</tr>

<tr>
<td class="right">275</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str500">str500  </a></td>
<td class="right">4</td>
<td class="right"><b>3962</b></td>
</tr>

<tr>
<td class="right">276</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str500">str500  </a></td>
<td class="right">5</td>
<td class="right"><b>3807</b></td>
</tr>

<tr>
<td class="right">277</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str501">str501  </a></td>
<td class="right">2</td>
<td class="right"><b>4517</b></td>
</tr>

<tr>
<td class="right">278</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str501">str501  </a></td>
<td class="right">3</td>
<td class="right"><b>4259</b></td>
</tr>

<tr>
<td class="right">279</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str501">str501  </a></td>
<td class="right">4</td>
<td class="right"><b>4095</b></td>
</tr>

<tr>
<td class="right">280</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str501">str501  </a></td>
<td class="right">5</td>
<td class="right"><b>3936</b></td>
</tr>

<tr>
<td class="right">281</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str502">str502  </a></td>
<td class="right">2</td>
<td class="right">6162</td>
</tr>

<tr>
<td class="right">282</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str502">str502  </a></td>
<td class="right">3</td>
<td class="right"><b>5823</b></td>
</tr>

<tr>
<td class="right">283</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str502">str502  </a></td>
<td class="right">4</td>
<td class="right"><b>5634</b></td>
</tr>

<tr>
<td class="right">284</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str502">str502  </a></td>
<td class="right">5</td>
<td class="right"><b>5482</b></td>
</tr>

<tr>
<td class="right">285</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str503">str503  </a></td>
<td class="right">2</td>
<td class="right">6090</td>
</tr>

<tr>
<td class="right">286</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str503">str503  </a></td>
<td class="right">3</td>
<td class="right"><b>5724</b></td>
</tr>

<tr>
<td class="right">287</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str503">str503  </a></td>
<td class="right">4</td>
<td class="right"><b>5530</b></td>
</tr>

<tr>
<td class="right">288</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str503">str503  </a></td>
<td class="right">5</td>
<td class="right"><b>5377</b></td>
</tr>

<tr>
<td class="right">289</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str504">str504  </a></td>
<td class="right">2</td>
<td class="right">7682</td>
</tr>

<tr>
<td class="right">290</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str504">str504  </a></td>
<td class="right">3</td>
<td class="right"><b>7300</b></td>
</tr>

<tr>
<td class="right">291</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str504">str504  </a></td>
<td class="right">4</td>
<td class="right"><b>7105</b></td>
</tr>

<tr>
<td class="right">292</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str504">str504  </a></td>
<td class="right">5</td>
<td class="right"><b>6919</b></td>
</tr>

<tr>
<td class="right">293</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str505">str505  </a></td>
<td class="right">2</td>
<td class="right">7723</td>
</tr>

<tr>
<td class="right">294</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str505">str505  </a></td>
<td class="right">3</td>
<td class="right"><b>7274</b></td>
</tr>

<tr>
<td class="right">295</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str505">str505  </a></td>
<td class="right">4</td>
<td class="right"><b>7073</b></td>
</tr>

<tr>
<td class="right">296</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str505">str505  </a></td>
<td class="right">5</td>
<td class="right"><b>6880</b></td>
</tr>

<tr>
<td class="right">297</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str506">str506  </a></td>
<td class="right">2</td>
<td class="right">9279</td>
</tr>

<tr>
<td class="right">298</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str506">str506  </a></td>
<td class="right">3</td>
<td class="right"><b>8852</b></td>
</tr>

<tr>
<td class="right">299</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str506">str506  </a></td>
<td class="right">4</td>
<td class="right"><b>8645</b></td>
</tr>

<tr>
<td class="right">300</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str506">str506  </a></td>
<td class="right">5</td>
<td class="right"><b>8449</b></td>
</tr>

<tr>
<td class="right">301</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str507">str507  </a></td>
<td class="right">2</td>
<td class="right">9271</td>
</tr>

<tr>
<td class="right">302</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str507">str507  </a></td>
<td class="right">3</td>
<td class="right"><b>8788</b></td>
</tr>

<tr>
<td class="right">303</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str507">str507  </a></td>
<td class="right">4</td>
<td class="right"><b>8582</b></td>
</tr>

<tr>
<td class="right">304</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str507">str507  </a></td>
<td class="right">5</td>
<td class="right"><b>8393</b></td>
</tr>

<tr>
<td class="right">305</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str508">str508  </a></td>
<td class="right">2</td>
<td class="right">0859</td>
</tr>

<tr>
<td class="right">306</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str508">str508  </a></td>
<td class="right">3</td>
<td class="right"><b>0358</b></td>
</tr>

<tr>
<td class="right">307</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str508">str508  </a></td>
<td class="right">4</td>
<td class="right">0138</td>
</tr>

<tr>
<td class="right">308</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str508">str508  </a></td>
<td class="right">&#xa0;</td>
<td class="right"><b>9941</b></td>
</tr>

<tr>
<td class="right">309</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str509">str509  </a></td>
<td class="right">2</td>
<td class="right">0776</td>
</tr>

<tr>
<td class="right">310</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str509">str509  </a></td>
<td class="right">3</td>
<td class="right"><b>0345</b></td>
</tr>

<tr>
<td class="right">311</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str509">str509  </a></td>
<td class="right">4</td>
<td class="right">0123</td>
</tr>

<tr>
<td class="right">312</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str509">str509  </a></td>
<td class="right">5</td>
<td class="right"><b>9933</b></td>
</tr>

<tr>
<td class="right">313</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str700">str700  </a></td>
<td class="right">2</td>
<td class="right">4727</td>
</tr>

<tr>
<td class="right">314</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str700">str700  </a></td>
<td class="right">3</td>
<td class="right"><b>4397</b></td>
</tr>

<tr>
<td class="right">315</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str700">str700  </a></td>
<td class="right">4</td>
<td class="right"><b>4249</b></td>
</tr>

<tr>
<td class="right">316</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str700">str700  </a></td>
<td class="right">5</td>
<td class="right"><b>4100</b></td>
</tr>

<tr>
<td class="right">317</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str701">str701  </a></td>
<td class="right">2</td>
<td class="right">4786</td>
</tr>

<tr>
<td class="right">318</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str701">str701  </a></td>
<td class="right">3</td>
<td class="right"><b>4375</b></td>
</tr>

<tr>
<td class="right">319</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str701">str701  </a></td>
<td class="right">4</td>
<td class="right"><b>4217</b></td>
</tr>

<tr>
<td class="right">320</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str701">str701  </a></td>
<td class="right">5</td>
<td class="right"><b>4069</b></td>
</tr>

<tr>
<td class="right">321</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str702">str702  </a></td>
<td class="right">2</td>
<td class="right">6494</td>
</tr>

<tr>
<td class="right">322</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str702">str702  </a></td>
<td class="right">3</td>
<td class="right"><b>6079</b></td>
</tr>

<tr>
<td class="right">323</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str702">str702  </a></td>
<td class="right">4</td>
<td class="right"><b>5877</b></td>
</tr>

<tr>
<td class="right">324</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str702">str702  </a></td>
<td class="right">5</td>
<td class="right"><b>5724</b></td>
</tr>

<tr>
<td class="right">325</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str703">str703  </a></td>
<td class="right">2</td>
<td class="right">6485</td>
</tr>

<tr>
<td class="right">326</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str703">str703  </a></td>
<td class="right">3</td>
<td class="right"><b>6079</b></td>
</tr>

<tr>
<td class="right">327</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str703">str703  </a></td>
<td class="right">4</td>
<td class="right"><b>5880</b></td>
</tr>

<tr>
<td class="right">328</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str703">str703  </a></td>
<td class="right">5</td>
<td class="right"><b>5728</b></td>
</tr>

<tr>
<td class="right">329</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str704">str704  </a></td>
<td class="right">2</td>
<td class="right">8298</td>
</tr>

<tr>
<td class="right">330</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str704">str704  </a></td>
<td class="right">3</td>
<td class="right"><b>7897</b></td>
</tr>

<tr>
<td class="right">331</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str704">str704  </a></td>
<td class="right">4</td>
<td class="right"><b>7694</b></td>
</tr>

<tr>
<td class="right">332</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str704">str704  </a></td>
<td class="right">5</td>
<td class="right"><b>7497</b></td>
</tr>

<tr>
<td class="right">333</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str705">str705  </a></td>
<td class="right">2</td>
<td class="right">8134</td>
</tr>

<tr>
<td class="right">334</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str705">str705  </a></td>
<td class="right">3</td>
<td class="right"><b>7688</b></td>
</tr>

<tr>
<td class="right">335</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str705">str705  </a></td>
<td class="right">4</td>
<td class="right"><b>7496</b></td>
</tr>

<tr>
<td class="right">336</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str705">str705  </a></td>
<td class="right">5</td>
<td class="right"><b>7311</b></td>
</tr>

<tr>
<td class="right">337</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str706">str706  </a></td>
<td class="right">2</td>
<td class="right">9863</td>
</tr>

<tr>
<td class="right">338</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str706">str706  </a></td>
<td class="right">3</td>
<td class="right"><b>9359</b></td>
</tr>

<tr>
<td class="right">339</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str706">str706  </a></td>
<td class="right">4</td>
<td class="right"><b>9153</b></td>
</tr>

<tr>
<td class="right">340</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str706">str706  </a></td>
<td class="right">5</td>
<td class="right"><b>8964</b></td>
</tr>

<tr>
<td class="right">341</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str707">str707  </a></td>
<td class="right">2</td>
<td class="right">9855</td>
</tr>

<tr>
<td class="right">342</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str707">str707  </a></td>
<td class="right">3</td>
<td class="right"><b>9467</b></td>
</tr>

<tr>
<td class="right">343</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str707">str707  </a></td>
<td class="right">4</td>
<td class="right"><b>9256</b></td>
</tr>

<tr>
<td class="right">344</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str707">str707  </a></td>
<td class="right">5</td>
<td class="right"><b>9065</b></td>
</tr>

<tr>
<td class="right">345</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str708">str708  </a></td>
<td class="right">2</td>
<td class="right">1361</td>
</tr>

<tr>
<td class="right">346</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str708">str708  </a></td>
<td class="right">3</td>
<td class="right"><b>0887</b></td>
</tr>

<tr>
<td class="right">347</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str708">str708  </a></td>
<td class="right">4</td>
<td class="right">0674</td>
</tr>

<tr>
<td class="right">348</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str708">str708  </a></td>
<td class="right">5</td>
<td class="right">0482</td>
</tr>

<tr>
<td class="right">349</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str709">str709  </a></td>
<td class="right">2</td>
<td class="right">1347</td>
</tr>

<tr>
<td class="right">350</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str709">str709  </a></td>
<td class="right">3</td>
<td class="right"><b>0765</b></td>
</tr>

<tr>
<td class="right">351</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str709">str709  </a></td>
<td class="right">4</td>
<td class="right">0561</td>
</tr>

<tr>
<td class="right">352</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/str709">str709  </a></td>
<td class="right">5</td>
<td class="right">0367</td>
</tr>

<tr>
<td class="right">353</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym300">sym300  </a></td>
<td class="right">2</td>
<td class="right"><b>1376</b></td>
</tr>

<tr>
<td class="right">354</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym300">sym300  </a></td>
<td class="right">3</td>
<td class="right"><b>1012</b></td>
</tr>

<tr>
<td class="right">355</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym300">sym300  </a></td>
<td class="right">4</td>
<td class="right"><b>965</b></td>
</tr>

<tr>
<td class="right">356</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym300">sym300  </a></td>
<td class="right">5</td>
<td class="right"><b>959</b></td>
</tr>

<tr>
<td class="right">357</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym301">sym301  </a></td>
<td class="right">2</td>
<td class="right"><b>1637</b></td>
</tr>

<tr>
<td class="right">358</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym301">sym301  </a></td>
<td class="right">3</td>
<td class="right"><b>1285</b></td>
</tr>

<tr>
<td class="right">359</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym301">sym301  </a></td>
<td class="right">4</td>
<td class="right"><b>1219</b></td>
</tr>

<tr>
<td class="right">360</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym301">sym301  </a></td>
<td class="right">5</td>
<td class="right"><b>1219</b></td>
</tr>

<tr>
<td class="right">361</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym302">sym302  </a></td>
<td class="right">2</td>
<td class="right">2048</td>
</tr>

<tr>
<td class="right">362</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym302">sym302  </a></td>
<td class="right">3</td>
<td class="right"><b>1311</b></td>
</tr>

<tr>
<td class="right">363</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym302">sym302  </a></td>
<td class="right">4</td>
<td class="right"><b>1256</b></td>
</tr>

<tr>
<td class="right">364</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym302">sym302  </a></td>
<td class="right">5</td>
<td class="right"><b>1252</b></td>
</tr>

<tr>
<td class="right">365</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym303">sym303  </a></td>
<td class="right">2</td>
<td class="right"><b>1494</b></td>
</tr>

<tr>
<td class="right">366</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym303">sym303  </a></td>
<td class="right">3</td>
<td class="right"><b>1125</b></td>
</tr>

<tr>
<td class="right">367</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym303">sym303  </a></td>
<td class="right">4</td>
<td class="right"><b>1090</b></td>
</tr>

<tr>
<td class="right">368</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym303">sym303  </a></td>
<td class="right">5</td>
<td class="right"><b>1090</b></td>
</tr>

<tr>
<td class="right">369</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym304">sym304  </a></td>
<td class="right">2</td>
<td class="right"><b>2511</b></td>
</tr>

<tr>
<td class="right">370</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym304">sym304  </a></td>
<td class="right">3</td>
<td class="right"><b>1722</b></td>
</tr>

<tr>
<td class="right">371</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym304">sym304  </a></td>
<td class="right">4</td>
<td class="right"><b>1686</b></td>
</tr>

<tr>
<td class="right">372</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym304">sym304  </a></td>
<td class="right">5</td>
<td class="right"><b>1686</b></td>
</tr>

<tr>
<td class="right">373</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym305">sym305  </a></td>
<td class="right">2</td>
<td class="right">1523</td>
</tr>

<tr>
<td class="right">374</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym305">sym305  </a></td>
<td class="right">3</td>
<td class="right"><b>958</b></td>
</tr>

<tr>
<td class="right">375</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym305">sym305  </a></td>
<td class="right">4</td>
<td class="right"><b>904</b></td>
</tr>

<tr>
<td class="right">376</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym305">sym305  </a></td>
<td class="right">5</td>
<td class="right"><b>903</b></td>
</tr>

<tr>
<td class="right">377</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym306">sym306  </a></td>
<td class="right">2</td>
<td class="right"><b>1588</b></td>
</tr>

<tr>
<td class="right">378</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym306">sym306  </a></td>
<td class="right">3</td>
<td class="right"><b>1110</b></td>
</tr>

<tr>
<td class="right">379</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym306">sym306  </a></td>
<td class="right">4</td>
<td class="right"><b>976</b></td>
</tr>

<tr>
<td class="right">380</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym306">sym306  </a></td>
<td class="right">5</td>
<td class="right"><b>976</b></td>
</tr>

<tr>
<td class="right">381</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym307">sym307  </a></td>
<td class="right">2</td>
<td class="right"><b>1750</b></td>
</tr>

<tr>
<td class="right">382</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym307">sym307  </a></td>
<td class="right">3</td>
<td class="right"><b>1280</b></td>
</tr>

<tr>
<td class="right">383</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym307">sym307  </a></td>
<td class="right">4</td>
<td class="right"><b>1271</b></td>
</tr>

<tr>
<td class="right">384</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym307">sym307  </a></td>
<td class="right">5</td>
<td class="right"><b>1271</b></td>
</tr>

<tr>
<td class="right">385</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym308">sym308  </a></td>
<td class="right">2</td>
<td class="right">2273</td>
</tr>

<tr>
<td class="right">386</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym308">sym308  </a></td>
<td class="right">3</td>
<td class="right"><b>1546</b></td>
</tr>

<tr>
<td class="right">387</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym308">sym308  </a></td>
<td class="right">4</td>
<td class="right"><b>1506</b></td>
</tr>

<tr>
<td class="right">388</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym308">sym308  </a></td>
<td class="right">5</td>
<td class="right"><b>1506</b></td>
</tr>

<tr>
<td class="right">389</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym309">sym309  </a></td>
<td class="right">2</td>
<td class="right"><b>1731</b></td>
</tr>

<tr>
<td class="right">390</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym309">sym309  </a></td>
<td class="right">3</td>
<td class="right"><b>1368</b></td>
</tr>

<tr>
<td class="right">391</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym309">sym309  </a></td>
<td class="right">4</td>
<td class="right"><b>1302</b></td>
</tr>

<tr>
<td class="right">392</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym309">sym309  </a></td>
<td class="right">5</td>
<td class="right"><b>1296</b></td>
</tr>

<tr>
<td class="right">393</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym500">sym500  </a></td>
<td class="right">2</td>
<td class="right">2522</td>
</tr>

<tr>
<td class="right">394</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym500">sym500  </a></td>
<td class="right">3</td>
<td class="right"><b>1156</b></td>
</tr>

<tr>
<td class="right">395</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym500">sym500  </a></td>
<td class="right">4</td>
<td class="right"><b>1105</b></td>
</tr>

<tr>
<td class="right">396</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym500">sym500  </a></td>
<td class="right">5</td>
<td class="right"><b>1098</b></td>
</tr>

<tr>
<td class="right">397</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym501">sym501  </a></td>
<td class="right">2</td>
<td class="right">2009</td>
</tr>

<tr>
<td class="right">398</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphsp/sym501">sym501 </a></td>
<td class="right">3</td>
<td class="right"><b>1106</b></td>
</tr>

<tr>
<td class="right">399</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym501">sym501  </a></td>
<td class="right">4</td>
<td class="right"><b>1065</b></td>
</tr>

<tr>
<td class="right">400</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym501">sym501  </a></td>
<td class="right">5</td>
<td class="right"><b>1045</b></td>
</tr>

<tr>
<td class="right">401</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym502">sym502  </a></td>
<td class="right">2</td>
<td class="right">2508</td>
</tr>

<tr>
<td class="right">402</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym502">sym502  </a></td>
<td class="right">3</td>
<td class="right"><b>1459</b></td>
</tr>

<tr>
<td class="right">403</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym502">sym502  </a></td>
<td class="right">4</td>
<td class="right"><b>1416</b></td>
</tr>

<tr>
<td class="right">404</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym502">sym502  </a></td>
<td class="right">5</td>
<td class="right"><b>1416</b></td>
</tr>

<tr>
<td class="right">405</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym503">sym503  </a></td>
<td class="right">2</td>
<td class="right">2166</td>
</tr>

<tr>
<td class="right">406</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym503">sym503  </a></td>
<td class="right">3</td>
<td class="right"><b>1431</b></td>
</tr>

<tr>
<td class="right">407</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym503">sym503  </a></td>
<td class="right">4</td>
<td class="right"><b>1367</b></td>
</tr>

<tr>
<td class="right">408</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym503">sym503  </a></td>
<td class="right">5</td>
<td class="right"><b>1349</b></td>
</tr>

<tr>
<td class="right">409</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym504">sym504  </a></td>
<td class="right">2</td>
<td class="right">2671</td>
</tr>

<tr>
<td class="right">410</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym504">sym504  </a></td>
<td class="right">3</td>
<td class="right"><b>1272</b></td>
</tr>

<tr>
<td class="right">411</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym504">sym504  </a></td>
<td class="right">4</td>
<td class="right"><b>1241</b></td>
</tr>

<tr>
<td class="right">412</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym504">sym504  </a></td>
<td class="right">5</td>
<td class="right"><b>1231</b></td>
</tr>

<tr>
<td class="right">413</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym505">sym505  </a></td>
<td class="right">2</td>
<td class="right">2666</td>
</tr>

<tr>
<td class="right">414</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym505">sym505  </a></td>
<td class="right">3</td>
<td class="right"><b>1441</b></td>
</tr>

<tr>
<td class="right">415</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym505">sym505  </a></td>
<td class="right">4</td>
<td class="right"><b>1276</b></td>
</tr>

<tr>
<td class="right">416</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym505">sym505  </a></td>
<td class="right">5</td>
<td class="right"><b>1268</b></td>
</tr>

<tr>
<td class="right">417</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym506">sym506  </a></td>
<td class="right">2</td>
<td class="right">2076</td>
</tr>

<tr>
<td class="right">418</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym506">sym506  </a></td>
<td class="right">3</td>
<td class="right"><b>1329</b></td>
</tr>

<tr>
<td class="right">419</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym506">sym506  </a></td>
<td class="right">4</td>
<td class="right"><b>1256</b></td>
</tr>

<tr>
<td class="right">420</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym506">sym506  </a></td>
<td class="right">5</td>
<td class="right"><b>1226</b></td>
</tr>

<tr>
<td class="right">421</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym507">sym507  </a></td>
<td class="right">2</td>
<td class="right">2174</td>
</tr>

<tr>
<td class="right">422</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym507">sym507  </a></td>
<td class="right">3</td>
<td class="right"><b>1163</b></td>
</tr>

<tr>
<td class="right">423</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym507">sym507  </a></td>
<td class="right">4</td>
<td class="right"><b>1106</b></td>
</tr>

<tr>
<td class="right">424</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym507">sym507  </a></td>
<td class="right">5</td>
<td class="right"><b>1093</b></td>
</tr>

<tr>
<td class="right">425</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym508">sym508  </a></td>
<td class="right">2</td>
<td class="right">2161</td>
</tr>

<tr>
<td class="right">426</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym508">sym508  </a></td>
<td class="right">3</td>
<td class="right"><b>1281</b></td>
</tr>

<tr>
<td class="right">427</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym508">sym508  </a></td>
<td class="right">4</td>
<td class="right"><b>1266</b></td>
</tr>

<tr>
<td class="right">428</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym508">sym508  </a></td>
<td class="right">5</td>
<td class="right"><b>1266</b></td>
</tr>

<tr>
<td class="right">429</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym509">sym509  </a></td>
<td class="right">2</td>
<td class="right">2470</td>
</tr>

<tr>
<td class="right">430</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym509">sym509  </a></td>
<td class="right">3</td>
<td class="right"><b>1190</b></td>
</tr>

<tr>
<td class="right">431</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym509">sym509  </a></td>
<td class="right">4</td>
<td class="right"><b>1160</b></td>
</tr>

<tr>
<td class="right">432</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym509">sym509  </a></td>
<td class="right">5</td>
<td class="right"><b>1160</b></td>
</tr>

<tr>
<td class="right">433</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym700">sym700  </a></td>
<td class="right">2</td>
<td class="right">2746</td>
</tr>

<tr>
<td class="right">434</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym700">sym700  </a></td>
<td class="right">3</td>
<td class="right"><b>1341</b></td>
</tr>

<tr>
<td class="right">435</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym700">sym700  </a></td>
<td class="right">4</td>
<td class="right"><b>1234</b></td>
</tr>

<tr>
<td class="right">436</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym700">sym700  </a></td>
<td class="right">5</td>
<td class="right"><b>1183</b></td>
</tr>

<tr>
<td class="right">437</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym701">sym701  </a></td>
<td class="right">2</td>
<td class="right">2908</td>
</tr>

<tr>
<td class="right">438</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym701">sym701  </a></td>
<td class="right">3</td>
<td class="right"><b>1270</b></td>
</tr>

<tr>
<td class="right">439</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym701">sym701  </a></td>
<td class="right">4</td>
<td class="right"><b>1198</b></td>
</tr>

<tr>
<td class="right">440</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym701">sym701  </a></td>
<td class="right">5</td>
<td class="right"><b>1186</b></td>
</tr>

<tr>
<td class="right">441</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym702">sym702  </a></td>
<td class="right">2</td>
<td class="right">2802</td>
</tr>

<tr>
<td class="right">442</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym702">sym702  </a></td>
<td class="right">3</td>
<td class="right"><b>1296</b></td>
</tr>

<tr>
<td class="right">443</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym702">sym702  </a></td>
<td class="right">4</td>
<td class="right"><b>1234</b></td>
</tr>

<tr>
<td class="right">444</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym702">sym702  </a></td>
<td class="right">5</td>
<td class="right"><b>1232</b></td>
</tr>

<tr>
<td class="right">445</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym703">sym703  </a></td>
<td class="right">2</td>
<td class="right">1859</td>
</tr>

<tr>
<td class="right">446</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym703">sym703  </a></td>
<td class="right">3</td>
<td class="right"><b>1033</b></td>
</tr>

<tr>
<td class="right">447</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym703">sym703  </a></td>
<td class="right">4</td>
<td class="right"><b>992</b></td>
</tr>

<tr>
<td class="right">448</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym703">sym703  </a></td>
<td class="right">5</td>
<td class="right"><b>990</b></td>
</tr>

<tr>
<td class="right">449</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym704">sym704  </a></td>
<td class="right">2</td>
<td class="right">2454</td>
</tr>

<tr>
<td class="right">450</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym704">sym704  </a></td>
<td class="right">3</td>
<td class="right"><b>1412</b></td>
</tr>

<tr>
<td class="right">451</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym704">sym704  </a></td>
<td class="right">4</td>
<td class="right"><b>1335</b></td>
</tr>

<tr>
<td class="right">452</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym704">sym704  </a></td>
<td class="right">5</td>
<td class="right"><b>1335</b></td>
</tr>

<tr>
<td class="right">453</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym705">sym705  </a></td>
<td class="right">2</td>
<td class="right">2860</td>
</tr>

<tr>
<td class="right">454</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym705">sym705  </a></td>
<td class="right">3</td>
<td class="right"><b>1347</b></td>
</tr>

<tr>
<td class="right">455</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym705">sym705  </a></td>
<td class="right">4</td>
<td class="right"><b>1298</b></td>
</tr>

<tr>
<td class="right">456</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym705">sym705  </a></td>
<td class="right">5</td>
<td class="right"><b>1283</b></td>
</tr>

<tr>
<td class="right">457</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym706">sym706  </a></td>
<td class="right">2</td>
<td class="right">1786</td>
</tr>

<tr>
<td class="right">458</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym706">sym706  </a></td>
<td class="right">3</td>
<td class="right"><b>987</b></td>
</tr>

<tr>
<td class="right">459</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym706">sym706  </a></td>
<td class="right">4</td>
<td class="right"><b>977</b></td>
</tr>

<tr>
<td class="right">460</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym706">sym706  </a></td>
<td class="right">5</td>
<td class="right"><b>958</b></td>
</tr>

<tr>
<td class="right">461</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym707">sym707  </a></td>
<td class="right">2</td>
<td class="right">3024</td>
</tr>

<tr>
<td class="right">462</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym707">sym707  </a></td>
<td class="right">3</td>
<td class="right"><b>1507</b></td>
</tr>

<tr>
<td class="right">463</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym707">sym707  </a></td>
<td class="right">4</td>
<td class="right"><b>1447</b></td>
</tr>

<tr>
<td class="right">464</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym707">sym707  </a></td>
<td class="right">5</td>
<td class="right"><b>1432</b></td>
</tr>

<tr>
<td class="right">465</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym708">sym708  </a></td>
<td class="right">2</td>
<td class="right">2472</td>
</tr>

<tr>
<td class="right">466</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym708">sym708  </a></td>
<td class="right">3</td>
<td class="right"><b>1318</b></td>
</tr>

<tr>
<td class="right">467</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym708">sym708  </a></td>
<td class="right">4</td>
<td class="right"><b>1284</b></td>
</tr>

<tr>
<td class="right">468</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym708">sym708  </a></td>
<td class="right">5</td>
<td class="right"><b>1271</b></td>
</tr>

<tr>
<td class="right">469</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym709">sym709  </a></td>
<td class="right">2</td>
<td class="right">2404</td>
</tr>

<tr>
<td class="right">470</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym709">sym709  </a></td>
<td class="right">3</td>
<td class="right"><b>1106</b></td>
</tr>

<tr>
<td class="right">471</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym709">sym709  </a></td>
<td class="right">4</td>
<td class="right"><b>1044</b></td>
</tr>

<tr>
<td class="right">472</td>
<td class="left"><a href="./instances/spanning_tree/SHRD-Graphs/sym709">sym709  </a></td>
<td class="right">5</td>
<td class="right"><b>1044</b></td>
</tr>
</tbody>
</table>
</div>
</div>
