spanningtree.org
* Additional Instances 
  [[./instances/spanning_tree/IEEE-Graphs/][Directory]], 
  [[./instances/spanning_tree/IEEE-Graphs.tar.gz][tar.gz format]] 

#+NAME: tab:additional
|    | File                                                               |
|----+--------------------------------------------------------------------|
|  1 | [[./instances/spanning_tree/IEEE-Graphs/R100n1][R100n1  ]]         |
|  2 | [[./instances/spanning_tree/IEEE-Graphs/R100n2][R100n2  ]]         |
|  3 | [[./instances/spanning_tree/IEEE-Graphs/R100n3][R100n3  ]]         |
|  4 | [[./instances/spanning_tree/IEEE-Graphs/R200n1][R200n1  ]]         |
|  5 | [[./instances/spanning_tree/IEEE-Graphs/R200n2][R200n2  ]]         |
|  6 | [[./instances/spanning_tree/IEEE-Graphs/R200n3][R200n3  ]]         |
|  7 | [[./instances/spanning_tree/IEEE-Graphs/R50n1][ R50n1   ]]         |
|  8 | [[./instances/spanning_tree/IEEE-Graphs/R50n2][ R50n2   ]]         |
|  9 | [[./instances/spanning_tree/IEEE-Graphs/R50n3][ R50n3   ]]         |
| 10 | [[./instances/spanning_tree/IEEE-Graphs/m050n1][m050n1  ]]         |
| 11 | [[./instances/spanning_tree/IEEE-Graphs/m050n2][m050n2  ]]         |
| 12 | [[./instances/spanning_tree/IEEE-Graphs/m050n3][m050n3  ]]         |
| 13 | [[./instances/spanning_tree/IEEE-Graphs/m100n1][m100n1  ]]         |
| 14 | [[./instances/spanning_tree/IEEE-Graphs/m100n2][m100n2  ]]         |
| 15 | [[./instances/spanning_tree/IEEE-Graphs/m100n3][m100n3  ]]         |
| 16 | [[./instances/spanning_tree/IEEE-Graphs/m200n1][m200n1  ]]         |
| 17 | [[./instances/spanning_tree/IEEE-Graphs/m200n2][m200n2  ]]         |
| 18 | [[./instances/spanning_tree/IEEE-Graphs/m200n3][m200n3  ]]         |
| 19 | [[./instances/spanning_tree/IEEE-Graphs/m300n1][m300n1  ]]         |
| 20 | [[./instances/spanning_tree/IEEE-Graphs/m400n1][m400n1  ]]         |
| 21 | [[./instances/spanning_tree/IEEE-Graphs/m500n1][m500n1  ]]         |
| 22 | [[./instances/spanning_tree/IEEE-Graphs/zhou-gen-9n][zhou-gen-9n]] |
|----+--------------------------------------------------------------------|
#+tblfm: $1=@#-1   

-----

[[./index.html][Back to benchmark instances page]]

[fn:1] *bold* indicates optimal solutions
