spanningtree.html

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Additional Instances</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="./instances/spanning_tree/IEEE-Graphs/">Directory</a>, 
<a href="./instances/spanning_tree/IEEE-Graphs.tar.gz">tar.gz format</a> 
</p>

<table id="tab:additional" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">&#xa0;</th>
<th scope="col" class="left">File</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1</td>
<td class="left"><a href="./instances/spanning_tree/IEEE-Graphs/R100n1">R100n1  </a></td>
</tr>

<tr>
<td class="right">2</td>
<td class="left"><a href="./instances/spanning_tree/IEEE-Graphs/R100n2">R100n2  </a></td>
</tr>

<tr>
<td class="right">3</td>
<td class="left"><a href="./instances/spanning_tree/IEEE-Graphs/R100n3">R100n3  </a></td>
</tr>

<tr>
<td class="right">4</td>
<td class="left"><a href="./instances/spanning_tree/IEEE-Graphs/R200n1">R200n1  </a></td>
</tr>

<tr>
<td class="right">5</td>
<td class="left"><a href="./instances/spanning_tree/IEEE-Graphs/R200n2">R200n2  </a></td>
</tr>

<tr>
<td class="right">6</td>
<td class="left"><a href="./instances/spanning_tree/IEEE-Graphs/R200n3">R200n3  </a></td>
</tr>

<tr>
<td class="right">7</td>
<td class="left"><a href="./instances/spanning_tree/IEEE-Graphs/R50n1"> R50n1   </a></td>
</tr>

<tr>
<td class="right">8</td>
<td class="left"><a href="./instances/spanning_tree/IEEE-Graphs/R50n2"> R50n2   </a></td>
</tr>

<tr>
<td class="right">9</td>
<td class="left"><a href="./instances/spanning_tree/IEEE-Graphs/R50n3"> R50n3   </a></td>
</tr>

<tr>
<td class="right">10</td>
<td class="left"><a href="./instances/spanning_tree/IEEE-Graphs/m050n1">m050n1  </a></td>
</tr>

<tr>
<td class="right">11</td>
<td class="left"><a href="./instances/spanning_tree/IEEE-Graphs/m050n2">m050n2  </a></td>
</tr>

<tr>
<td class="right">12</td>
<td class="left"><a href="./instances/spanning_tree/IEEE-Graphs/m050n3">m050n3  </a></td>
</tr>

<tr>
<td class="right">13</td>
<td class="left"><a href="./instances/spanning_tree/IEEE-Graphs/m100n1">m100n1  </a></td>
</tr>

<tr>
<td class="right">14</td>
<td class="left"><a href="./instances/spanning_tree/IEEE-Graphs/m100n2">m100n2  </a></td>
</tr>

<tr>
<td class="right">15</td>
<td class="left"><a href="./instances/spanning_tree/IEEE-Graphs/m100n3">m100n3  </a></td>
</tr>

<tr>
<td class="right">16</td>
<td class="left"><a href="./instances/spanning_tree/IEEE-Graphs/m200n1">m200n1  </a></td>
</tr>

<tr>
<td class="right">17</td>
<td class="left"><a href="./instances/spanning_tree/IEEE-Graphs/m200n2">m200n2  </a></td>
</tr>

<tr>
<td class="right">18</td>
<td class="left"><a href="./instances/spanning_tree/IEEE-Graphs/m200n3">m200n3  </a></td>
</tr>

<tr>
<td class="right">19</td>
<td class="left"><a href="./instances/spanning_tree/IEEE-Graphs/m300n1">m300n1  </a></td>
</tr>

<tr>
<td class="right">20</td>
<td class="left"><a href="./instances/spanning_tree/IEEE-Graphs/m400n1">m400n1  </a></td>
</tr>

<tr>
<td class="right">21</td>
<td class="left"><a href="./instances/spanning_tree/IEEE-Graphs/m500n1">m500n1  </a></td>
</tr>

<tr>
<td class="right">22</td>
<td class="left"><a href="./instances/spanning_tree/IEEE-Graphs/zhou-gen-9n">zhou-gen-9n</a></td>
</tr>
</tbody>
</table>

<hr  />

<p>
<a href="./index.html">Back to benchmark instances page</a>
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
<b>bold</b> indicates optimal solutions
</p></div>


</div>
</div></div>
</body>
</html>
